{
  "species": {
    "ABOMASNOW": 1,
    "ALCREMIE": 2,
    "ALCREMIECARAMELSWIRL": 3,
    "ALCREMIELEMONCREAM": 4,
    "ALCREMIEMATCHACREAM": 5,
    "ALCREMIEMINTCREAM": 6,
    "ALCREMIERAINBOWSWIRL": 7,
    "ALCREMIERUBYSWIRL": 8,
    "ALCREMIESALTEDCREAM": 9,
    "ALOMOMOLA": 10,
    "ALTARIA": 11,
    "AMBIPOM": 12,
    "AMOONGUSS": 13,
    "AMPHAROS": 14,
    "ANNIHILAPE": 15,
    "APPLETUN": 16,
    "ARAQUANID": 17,
    "ARBOK": 18,
    "ARBOLIVA": 19,
    "ARCANINE": 20,
    "ARCANINEHISUI": 21,
    "ARCEUS": 22,
    "ARCEUSBUG": 23,
    "ARCEUSDARK": 24,
    "ARCEUSDRAGON": 25,
    "ARCEUSELECTRIC": 26,
    "ARCEUSFAIRY": 27,
    "ARCEUSFIGHTING": 28,
    "ARCEUSFIRE": 29,
    "ARCEUSFLYING": 30,
    "ARCEUSGHOST": 31,
    "ARCEUSGRASS": 32,
    "ARCEUSGROUND": 33,
    "ARCEUSICE": 34,
    "ARCEUSPOISON": 35,
    "ARCEUSPSYCHIC": 36,
    "ARCEUSROCK": 37,
    "ARCEUSSTEEL": 38,
    "ARCEUSWATER": 39,
    "ARCHALUDON": 40,
    "ARIADOS": 41,
    "ARMAROUGE": 42,
    "ARTICUNO": 43,
    "ARTICUNOGALAR": 44,
    "AVALUGG": 45,
    "AVALUGGHISUI": 46,
    "AZELF": 47,
    "AZUMARILL": 48,
    "BANETTE": 49,
    "BARRASKEWDA": 50,
    "BASCULEGION": 51,
    "BASCULEGIONF": 52,
    "BASCULIN": 53,
    "BASCULINBLUESTRIPED": 54,
    "BASTIODON": 55,
    "BAXCALIBUR": 56,
    "BEARTIC": 57,
    "BELLIBOLT": 58,
    "BELLOSSOM": 59,
    "BISHARP": 60,
    "BLASTOISE": 61,
    "BLAZIKEN": 62,
    "BLISSEY": 63,
    "BOMBIRDIER": 64,
    "BRAMBLEGHAST": 65,
    "BRAVIARY": 66,
    "BRAVIARYHISUI": 67,
    "BRELOOM": 68,
    "BRONZONG": 69,
    "BRUTEBONNET": 70,
    "BRUXISH": 71,
    "CACTURNE": 72,
    "CALYREX": 73,
    "CALYREXICE": 74,
    "CALYREXSHADOW": 75,
    "CAMERUPT": 76,
    "CARBINK": 77,
    "CERULEDGE": 78,
    "CETITAN": 79,
    "CHANDELURE": 80,
    "CHANSEY": 81,
    "CHARIZARD": 82,
    "CHESNAUGHT": 83,
    "CHIENPAO": 84,
    "CHIMECHO": 85,
    "CHIYU": 86,
    "CINCCINO": 87,
    "CINDERACE": 88,
    "CLAWITZER": 89,
    "CLEFABLE": 90,
    "CLODSIRE": 91,
    "CLOYSTER": 92,
    "COALOSSAL": 93,
    "COBALION": 94,
    "COMFEY": 95,
    "CONKELDURR": 96,
    "COPPERAJAH": 97,
    "CORVIKNIGHT": 98,
    "CRABOMINABLE": 99,
    "CRAMORANT": 100,
    "CRAMORANTGORGING": 101,
    "CRAMORANTGULPING": 102,
    "CRAWDAUNT": 103,
    "CRESSELIA": 104,
    "CRYOGONAL": 105,
    "CYCLIZAR": 106,
    "DACHSBUN": 107,
    "DARKRAI": 108,
    "DECIDUEYE": 109,
    "DECIDUEYEHISUI": 110,
    "DEDENNE": 111,
    "DELIBIRD": 112,
    "DELPHOX": 113,
    "DEOXYS": 114,
    "DEOXYSATTACK": 115,
    "DEOXYSDEFENSE": 116,
    "DEOXYSSPEED": 117,
    "DEWGONG": 118,
    "DIALGA": 119,
    "DIALGAORIGIN": 120,
    "DIANCIE": 121,
    "DIPPLIN": 122,
    "DITTO": 123,
    "DODRIO": 124,
    "DONDOZO": 125,
    "DONPHAN": 126,
    "DRAGALGE": 127,
    "DRAGAPULT": 128,
    "DRAGONITE": 129,
    "DREDNAW": 130,
    "DRIFBLIM": 131,
    "DUDUNSPARCE": 132,
    "DUDUNSPARCETHREESEGMENT": 133,
    "DUGTRIO": 134,
    "DUGTRIOALOLA": 135,
    "DUNSPARCE": 136,
    "DURALUDON": 137,
    "DUSKNOIR": 138,
    "EELEKTROSS": 139,
    "EISCUE": 140,
    "EISCUENOICE": 141,
    "ELECTIVIRE": 142,
    "ELECTRODE": 143,
    "ELECTRODEHISUI": 144,
    "EMBOAR": 145,
    "EMPOLEON": 146,
    "ENAMORUS": 147,
    "ENAMORUSTHERIAN": 148,
    "ENTEI": 149,
    "ESPATHRA": 150,
    "ESPEON": 151,
    "ETERNATUS": 152,
    "EXCADRILL": 153,
    "EXEGGUTOR": 154,
    "EXEGGUTORALOLA": 155,
    "FALINKS": 156,
    "FARIGIRAF": 157,
    "FERALIGATR": 158,
    "FEZANDIPITI": 159,
    "FLAMIGO": 160,
    "FLAPPLE": 161,
    "FLAREON": 162,
    "FLOATZEL": 163,
    "FLORGES": 164,
    "FLORGESBLUE": 165,
    "FLORGESORANGE": 166,
    "FLORGESWHITE": 167,
    "FLORGESYELLOW": 168,
    "FLUTTERMANE": 169,
    "FLYGON": 170,
    "FORRETRESS": 171,
    "FROSLASS": 172,
    "FROSMOTH": 173,
    "FURRET": 174,
    "GALLADE": 175,
    "GALVANTULA": 176,
    "GARCHOMP": 177,
    "GARDEVOIR": 178,
    "GARGANACL": 179,
    "GASTRODON": 180,
    "GASTRODONEAST": 181,
    "GENGAR": 182,
    "GHOLDENGO": 183,
    "GIRAFARIG": 184,
    "GIRATINA": 185,
    "GIRATINAORIGIN": 186,
    "GLACEON": 187,
    "GLALIE": 188,
    "GLASTRIER": 189,
    "GLIMMORA": 190,
    "GLISCOR": 191,
    "GOGOAT": 192,
    "GOLDUCK": 193,
    "GOLEM": 194,
    "GOLEMALOLA": 195,
    "GOLURK": 196,
    "GOODRA": 197,
    "GOODRAHISUI": 198,
    "GOTHITELLE": 199,
    "GOUGINGFIRE": 200,
    "GRAFAIAI": 201,
    "GRANBULL": 202,
    "GREATTUSK": 203,
    "GREEDENT": 204,
    "GRENINJA": 205,
    "GRIMMSNARL": 206,
    "GROUDON": 207,
    "GRUMPIG": 208,
    "GUMSHOOS": 209,
    "GURDURR": 210,
    "GYARADOS": 211,
    "HARIYAMA": 212,
    "HATTERENE": 213,
    "HAWLUCHA": 214,
    "HAXORUS": 215,
    "HEATRAN": 216,
    "HERACROSS": 217,
    "HIPPOWDON": 218,
    "HITMONCHAN": 219,
    "HITMONLEE": 220,
    "HITMONTOP": 221,
    "HONCHKROW": 222,
    "HOOH": 223,
    "HOOPA": 224,
    "HOOPAUNBOUND": 225,
    "HOUNDOOM": 226,
    "HOUNDSTONE": 227,
    "HYDRAPPLE": 228,
    "HYDREIGON": 229,
    "HYPNO": 230,
    "ILLUMISE": 231,
    "INCINEROAR": 232,
    "INDEEDEE": 233,
    "INDEEDEEF": 234,
    "INFERNAPE": 235,
    "INTELEON": 236,
    "IRONBOULDER": 237,
    "IRONBUNDLE": 238,
    "IRONCROWN": 239,
    "IRONHANDS": 240,
    "IRONJUGULIS": 241,
    "IRONLEAVES": 242,
    "IRONMOTH": 243,
    "IRONTHORNS": 244,
    "IRONTREADS": 245,
    "IRONVALIANT": 246,
    "JIRACHI": 247,
    "JOLTEON": 248,
    "JUMPLUFF": 249,
    "KELDEORESOLUTE": 250,
    "KILOWATTREL": 251,
    "KINGAMBIT": 252,
    "KINGDRA": 253,
    "KLAWF": 254,
    "KLEAVOR": 255,
    "KLEFKI": 256,
    "KOMALA": 257,
    "KOMMOO": 258,
    "KORAIDON": 259,
    "KRICKETUNE": 260,
    "KROOKODILE": 261,
    "KYOGRE": 262,
    "KYUREM": 263,
    "KYUREMBLACK": 264,
    "KYUREMWHITE": 265,
    "LANDORUS": 266,
    "LANDORUSTHERIAN": 267,
    "LANTURN": 268,
    "LAPRAS": 269,
    "LATIAS": 270,
    "LATIOS": 271,
    "LEAFEON": 272,
    "LEAVANNY": 273,
    "LILLIGANT": 274,
    "LILLIGANTHISUI": 275,
    "LOKIX": 276,
    "LUCARIO": 277,
    "LUDICOLO": 278,
    "LUGIA": 279,
    "LUMINEON": 280,
    "LUNALA": 281,
    "LURANTIS": 282,
    "LUVDISC": 283,
    "LUXRAY": 284,
    "LYCANROC": 285,
    "LYCANROCDUSK": 286,
    "LYCANROCMIDNIGHT": 287,
    "MABOSSTIFF": 288,
    "MAGCARGO": 289,
    "MAGEARNA": 290,
    "MAGEARNAORIGINAL": 291,
    "MAGMORTAR": 292,
    "MAGNEZONE": 293,
    "MALAMAR": 294,
    "MAMOSWINE": 295,
    "MANAPHY": 296,
    "MANDIBUZZ": 297,
    "MASQUERAIN": 298,
    "MAUSHOLD": 299,
    "MAUSHOLDFOUR": 300,
    "MEDICHAM": 301,
    "MEGANIUM": 302,
    "MELOETTA": 303,
    "MELOETTAPIROUETTE": 304,
    "MEOWSCARADA": 305,
    "MEOWSTIC": 306,
    "MEOWSTICF": 307,
    "MESPRIT": 308,
    "METAGROSS": 309,
    "MEW": 310,
    "MEWTWO": 311,
    "MIENSHAO": 312,
    "MIGHTYENA": 313,
    "MILOTIC": 314,
    "MIMIKYU": 315,
    "MIMIKYUBUSTED": 316,
    "MINIOR": 317,
    "MINIORBLUE": 318,
    "MINIORGREEN": 319,
    "MINIORINDIGO": 320,
    "MINIORMETEOR": 321,
    "MINIORORANGE": 322,
    "MINIORVIOLET": 323,
    "MINIORYELLOW": 324,
    "MINUN": 325,
    "MIRAIDON": 326,
    "MISDREAVUS": 327,
    "MISMAGIUS": 328,
    "MOLTRES": 329,
    "MOLTRESGALAR": 330,
    "MORPEKO": 331,
    "MORPEKOHANGRY": 332,
    "MUDSDALE": 333,
    "MUK": 334,
    "MUKALOLA": 335,
    "MUNKIDORI": 336,
    "NECROZMA": 337,
    "NECROZMADAWNWINGS": 338,
    "NECROZMADUSKMANE": 339,
    "NINETALES": 340,
    "NINETALESALOLA": 341,
    "NOCTOWL": 342,
    "NOIVERN": 343,
    "NONE": 344,
    "OGERPON": 345,
    "OGERPONCORNERSTONE": 346,
    "OGERPONCORNERSTONETERA": 347,
    "OGERPONHEARTHFLAME": 348,
    "OGERPONHEARTHFLAMETERA": 349,
    "OGERPONWELLSPRING": 350,
    "OGERPONWELLSPRINGTERA": 351,
    "OINKOLOGNE": 352,
    "OINKOLOGNEF": 353,
    "OKIDOGI": 354,
    "ORANGURU": 355,
    "ORICORIO": 356,
    "ORICORIOPAU": 357,
    "ORICORIOPOMPOM": 358,
    "ORICORIOSENSU": 359,
    "ORTHWORM": 360,
    "OVERQWIL": 361,
    "PACHIRISU": 362,
    "PALAFIN": 363,
    "PALAFINHERO": 364,
    "PALKIA": 365,
    "PALKIAORIGIN": 366,
    "PALOSSAND": 367,
    "PASSIMIAN": 368,
    "PAWMOT": 369,
    "PECHARUNT": 370,
    "PELIPPER": 371,
    "PERRSERKER": 372,
    "PERSIAN": 373,
    "PERSIANALOLA": 374,
    "PHIONE": 375,
    "PIKACHU": 376,
    "PIKACHUALOLA": 377,
    "PIKACHUHOENN": 378,
    "PIKACHUKALOS": 379,
    "PIKACHUORIGINAL": 380,
    "PIKACHUPARTNER": 381,
    "PIKACHUSINNOH": 382,
    "PIKACHUUNOVA": 383,
    "PIKACHUWORLD": 384,
    "PILOSWINE": 385,
    "PINCURCHIN": 386,
    "PLUSLE": 387,
    "POLITOED": 388,
    "POLIWRATH": 389,
    "POLTEAGEIST": 390,
    "POLTEAGEISTANTIQUE": 391,
    "PORYGON2": 392,
    "PORYGONZ": 393,
    "PRIMARINA": 394,
    "PROBOPASS": 395,
    "PYROAR": 396,
    "QUAGSIRE": 397,
    "QUAQUAVAL": 398,
    "QWILFISH": 399,
    "QWILFISHHISUI": 400,
    "RABSCA": 401,
    "RAGINGBOLT": 402,
    "RAICHU": 403,
    "RAICHUALOLA": 404,
    "RAIKOU": 405,
    "RAMPARDOS": 406,
    "RAYQUAZA": 407,
    "REGICE": 408,
    "REGIDRAGO": 409,
    "REGIELEKI": 410,
    "REGIGIGAS": 411,
    "REGIROCK": 412,
    "REGISTEEL": 413,
    "RESHIRAM": 414,
    "REUNICLUS": 415,
    "REVAVROOM": 416,
    "RHYDON": 417,
    "RHYPERIOR": 418,
    "RIBOMBEE": 419,
    "RILLABOOM": 420,
    "ROARINGMOON": 421,
    "ROTOM": 422,
    "ROTOMFAN": 423,
    "ROTOMFROST": 424,
    "ROTOMHEAT": 425,
    "ROTOMMOW": 426,
    "ROTOMWASH": 427,
    "SABLEYE": 428,
    "SALAMENCE": 429,
    "SALAZZLE": 430,
    "SAMUROTT": 431,
    "SAMUROTTHISUI": 432,
    "SANDACONDA": 433,
    "SANDSLASH": 434,
    "SANDSLASHALOLA": 435,
    "SANDYSHOCKS": 436,
    "SAWSBUCK": 437,
    "SAWSBUCKAUTUMN": 438,
    "SAWSBUCKSUMMER": 439,
    "SAWSBUCKWINTER": 440,
    "SCEPTILE": 441,
    "SCIZOR": 442,
    "SCOVILLAIN": 443,
    "SCRAFTY": 444,
    "SCREAMTAIL": 445,
    "SCYTHER": 446,
    "SERPERIOR": 447,
    "SEVIPER": 448,
    "SHAYMIN": 449,
    "SHAYMINSKY": 450,
    "SHIFTRY": 451,
    "SINISTCHA": 452,
    "SINISTCHAMASTERPIECE": 453,
    "SKARMORY": 454,
    "SKELEDIRGE": 455,
    "SKUNTANK": 456,
    "SLAKING": 457,
    "SLITHERWING": 458,
    "SLOWBRO": 459,
    "SLOWBROGALAR": 460,
    "SLOWKING": 461,
    "SLOWKINGGALAR": 462,
    "SMEARGLE": 463,
    "SNEASLER": 464,
    "SNORLAX": 465,
    "SOLGALEO": 466,
    "SPECTRIER": 467,
    "SPIDOPS": 468,
    "SPIRITOMB": 469,
    "SQUAWKABILLY": 470,
    "SQUAWKABILLYBLUE": 471,
    "SQUAWKABILLYWHITE": 472,
    "SQUAWKABILLYYELLOW": 473,
    "STARAPTOR": 474,
    "STONJOURNER": 475,
    "SUDOWOODO": 476,
    "SUICUNE": 477,
    "SUNFLORA": 478,
    "SWALOT": 479,
    "SWAMPERT": 480,
    "SWANNA": 481,
    "SYLVEON": 482,
    "TALONFLAME": 483,
    "TATSUGIRI": 484,
    "TAUROS": 485,
    "TAUROSPALDEAAQUA": 486,
    "TAUROSPALDEABLAZE": 487,
    "TAUROSPALDEACOMBAT": 488,
    "TENTACRUEL": 489,
    "TERAPAGOS": 490,
    "TERAPAGOSSTELLAR": 491,
    "TERAPAGOSTERASTAL": 492,
    "TERRAKION": 493,
    "THUNDURUS": 494,
    "THUNDURUSTHERIAN": 495,
    "TINGLU": 496,
    "TINKATON": 497,
    "TOEDSCRUEL": 498,
    "TORKOAL": 499,
    "TORNADUS": 500,
    "TORNADUSTHERIAN": 501,
    "TORTERRA": 502,
    "TOUCANNON": 503,
    "TOXAPEX": 504,
    "TOXICROAK": 505,
    "TOXTRICITY": 506,
    "TREVENANT": 507,
    "TROPIUS": 508,
    "TSAREENA": 509,
    "TYPHLOSION": 510,
    "TYPHLOSIONHISUI": 511,
    "TYRANITAR": 512,
    "UMBREON": 513,
    "URSALUNA": 514,
    "URSALUNABLOODMOON": 515,
    "URSARING": 516,
    "URSHIFU": 517,
    "URSHIFURAPIDSTRIKE": 518,
    "UXIE": 519,
    "VAPOREON": 520,
    "VELUZA": 521,
    "VENOMOTH": 522,
    "VENUSAUR": 523,
    "VESPIQUEN": 524,
    "VICTREEBEL": 525,
    "VIGOROTH": 526,
    "VIKAVOLT": 527,
    "VILEPLUME": 528,
    "VIRIZION": 529,
    "VIVILLON": 530,
    "VIVILLONARCHIPELAGO": 531,
    "VIVILLONELEGANT": 532,
    "VIVILLONGARDEN": 533,
    "VIVILLONHIGHPLAINS": 534,
    "VIVILLONICYSNOW": 535,
    "VIVILLONMODERN": 536,
    "VIVILLONMONSOON": 537,
    "VIVILLONOCEAN": 538,
    "VIVILLONPOLAR": 539,
    "VIVILLONRIVER": 540,
    "VIVILLONSANDSTORM": 541,
    "VIVILLONSAVANNA": 542,
    "VIVILLONSUN": 543,
    "VIVILLONTUNDRA": 544,
    "VOLBEAT": 545,
    "VOLCANION": 546,
    "VOLCARONA": 547,
    "WALKINGWAKE": 548,
    "WEAVILE": 549,
    "WEEZING": 550,
    "WEEZINGGALAR": 551,
    "WHIMSICOTT": 552,
    "WHISCASH": 553,
    "WIGGLYTUFF": 554,
    "WOCHIEN": 555,
    "WUGTRIO": 556,
    "WYRDEER": 557,
    "YANMEGA": 558,
    "ZACIAN": 559,
    "ZACIANCROWNED": 560,
    "ZAMAZENTA": 561,
    "ZAMAZENTACROWNED": 562,
    "ZANGOOSE": 563,
    "ZAPDOS": 564,
    "ZAPDOSGALAR": 565,
    "ZARUDE": 566,
    "ZARUDEDADA": 567,
    "ZEBSTRIKA": 568,
    "ZEKROM": 569,
    "ZOROARK": 570,
    "ZOROARKHISUI": 571
  },
  "moves": {
    "ACCELEROCK": 1,
    "ACROBATICS": 2,
    "AEROBLAST": 3,
    "AGILITY": 4,
    "AIRSLASH": 5,
    "ALLURINGVOICE": 6,
    "APPLEACID": 7,
    "AQUACUTTER": 8,
    "AQUAJET": 9,
    "AQUASTEP": 10,
    "ARMORCANNON": 11,
    "ASTRALBARRAGE": 12,
    "AURASPHERE": 13,
    "AURAWHEEL": 14,
    "AURORAVEIL": 15,
    "AVALANCHE": 16,
    "BEAKBLAST": 17,
    "BEATUP": 18,
    "BEHEMOTHBLADE": 19,
    "BELLYDRUM": 20,
    "BITE": 21,
    "BITTERBLADE": 22,
    "BITTERMALICE": 23,
    "BLEAKWINDSTORM": 24,
    "BLIZZARD": 25,
    "BLOODMOON": 26,
    "BLUEFLARE": 27,
    "BODYPRESS": 28,
    "BODYSLAM": 29,
    "BOLTSTRIKE": 30,
    "BOOMBURST": 31,
    "BRAVEBIRD": 32,
    "BRICKBREAK": 33,
    "BUGBITE": 34,
    "BUGBUZZ": 35,
    "BULKUP": 36,
    "BULLETPUNCH": 37,
    "BULLETSEED": 38,
    "BURNINGJEALOUSY": 39,
    "CALMMIND": 40,
    "CEASELESSEDGE": 41,
    "CHILLYRECEPTION": 42,
    "CIRCLETHROW": 43,
    "CLANGINGSCALES": 44,
    "CLANGOROUSSOUL": 45,
    "CLEARSMOG": 46,
    "CLOSECOMBAT": 47,
    "COIL": 48,
    "COLLISIONCOURSE": 49,
    "COSMICPOWER": 50,
    "COURTCHANGE": 51,
    "CRABHAMMER": 52,
    "CRUNCH": 53,
    "CURSE": 54,
    "DARKPULSE": 55,
    "DAZZLINGGLEAM": 56,
    "DEFOG": 57,
    "DESTINYBOND": 58,
    "DIAMONDSTORM": 59,
    "DIRECLAW": 60,
    "DISCHARGE": 61,
    "DOUBLEEDGE": 62,
    "DOUBLESHOCK": 63,
    "DRACOMETEOR": 64,
    "DRAGONASCENT": 65,
    "DRAGONCLAW": 66,
    "DRAGONDANCE": 67,
    "DRAGONDARTS": 68,
    "DRAGONENERGY": 69,
    "DRAGONPULSE": 70,
    "DRAGONTAIL": 71,
    "DRAININGKISS": 72,
    "DRAINPUNCH": 73,
    "DRILLRUN": 74,
    "DUALWINGBEAT": 75,
    "DYNAMAXCANNON": 76,
    "DYNAMICPUNCH": 77,
    "EARTHPOWER": 78,
    "EARTHQUAKE": 79,
    "ELECTRODRIFT": 80,
    "ENCORE": 81,
    "ENDEAVOR": 82,
    "ENERGYBALL": 83,
    "ERUPTION": 84,
    "ESPERWING": 85,
    "EXPANDINGFORCE": 86,
    "EXPLOSION": 87,
    "EXTREMESPEED": 88,
    "FACADE": 89,
    "FAKEOUT": 90,
    "FICKLEBEAM": 91,
    "FIERYDANCE": 92,
    "FIERYWRATH": 93,
    "FILLETAWAY": 94,
    "FIREBLAST": 95,
    "FIREFANG": 96,
    "FIREPUNCH": 97,
    "FIRSTIMPRESSION": 98,
    "FLAMECHARGE": 99,
    "FLAMETHROWER": 100,
    "FLAREBLITZ": 101,
    "FLASHCANNON": 102,
    "FLEURCANNON": 103,
    "FLIPTURN": 104,
    "FLOWERTRICK": 105,
    "FOCUSBLAST": 106,
    "FOCUSPUNCH": 107,
    "FOULPLAY": 108,
    "FREEZEDRY": 109,
    "FREEZINGGLARE": 110,
    "FUSIONBOLT": 111,
    "FUSIONFLARE": 112,
    "FUTURESIGHT": 113,
    "GIGADRAIN": 114,
    "GIGAIMPACT": 115,
    "GIGATONHAMMER": 116,
    "GLACIALLANCE": 117,
    "GLAIVERUSH": 118,
    "GLARE": 119,
    "GRASSKNOT": 120,
    "GRASSYGLIDE": 121,
    "GRAVAPPLE": 122,
    "GUNKSHOT": 123,
    "HAZE": 124,
    "HEADBUTT": 125,
    "HEADLONGRUSH": 126,
    "HEADSMASH": 127,
    "HEALBELL": 128,
    "HEALINGWISH": 129,
    "HEATCRASH": 130,
    "HEATWAVE": 131,
    "HEAVYSLAM": 132,
    "HEX": 133,
    "HIGHHORSEPOWER": 134,
    "HIGHJUMPKICK": 135,
    "HORNLEECH": 136,
    "HURRICANE": 137,
    "HYDROPUMP": 138,
    "HYDROSTEAM": 139,
    "HYPERSPACEFURY": 140,
    "HYPERVOICE": 141,
    "HYPNOSIS": 142,
    "ICEBEAM": 143,
    "ICEFANG": 144,
    "ICEHAMMER": 145,
    "ICEPUNCH": 146,
    "ICESHARD": 147,
    "ICESPINNER": 148,
    "ICICLECRASH": 149,
    "ICICLESPEAR": 150,
    "IRONDEFENSE": 151,
    "IRONHEAD": 152,
    "IRONTAIL": 153,
    "IVYCUDGEL": 154,
    "JETPUNCH": 155,
    "JUDGMENT": 156,
    "KNOCKOFF": 157,
    "KOWTOWCLEAVE": 158,
    "LASHOUT": 159,
    "LAVAPLUME": 160,
    "LEAFBLADE": 161,
    "LEAFSTORM": 162,
    "LEECHLIFE": 163,
    "LEECHSEED": 164,
    "LIGHTSCREEN": 165,
    "LIQUIDATION": 166,
    "LOWKICK": 167,
    "LUMINACRASH": 168,
    "LUNGE": 169,
    "LUSTERPURGE": 170,
    "MACHPUNCH": 171,
    "MAGMASTORM": 172,
    "MAGNETRISE": 173,
    "MAKEITRAIN": 174,
    "MALIGNANTCHAIN": 175,
    "MATCHAGOTCHA": 176,
    "MEGAHORN": 177,
    "METEORBEAM": 178,
    "METEORMASH": 179,
    "MIGHTYCLEAVE": 180,
    "MILKDRINK": 181,
    "MIRRORCOAT": 182,
    "MOONBLAST": 183,
    "MOONGEISTBEAM": 184,
    "MOONLIGHT": 185,
    "MORNINGSUN": 186,
    "MORTALSPIN": 187,
    "MUDDYWATER": 188,
    "MUDSHOT": 189,
    "MYSTICALFIRE": 190,
    "NASTYPLOT": 191,
    "NIGHTSHADE": 192,
    "NIGHTSLASH": 193,
    "NONE": 194,
    "NORETREAT": 195,
    "NUZZLE": 196,
    "ORIGINPULSE": 197,
    "OUTRAGE": 198,
    "OVERDRIVE": 199,
    "OVERHEAT": 200,
    "PAINSPLIT": 201,
    "PARTINGSHOT": 202,
    "PAYBACK": 203,
    "PETALBLIZZARD": 204,
    "PETALDANCE": 205,
    "PHOTONGEYSER": 206,
    "PLAYROUGH": 207,
    "POISONFANG": 208,
    "POISONJAB": 209,
    "POLLENPUFF": 210,
    "POLTERGEIST": 211,
    "POPULATIONBOMB": 212,
    "POUNCE": 213,
    "POWERGEM": 214,
    "POWERTRIP": 215,
    "POWERWHIP": 216,
    "PRECIPICEBLADES": 217,
    "PROTECT": 218,
    "PSYBLADE": 219,
    "PSYCHIC": 220,
    "PSYCHICFANGS": 221,
    "PSYCHICNOISE": 222,
    "PSYCHOBOOST": 223,
    "PSYCHOCUT": 224,
    "PSYSHOCK": 225,
    "PSYSTRIKE": 226,
    "PYROBALL": 227,
    "QUICKATTACK": 228,
    "QUIVERDANCE": 229,
    "RAGEFIST": 230,
    "RAGINGBULL": 231,
    "RAINDANCE": 232,
    "RAPIDSPIN": 233,
    "RAZORSHELL": 234,
    "RECHARGE": 235,
    "RECOVER": 236,
    "REFLECT": 237,
    "RELICSONG": 238,
    "REST": 239,
    "REVELATIONDANCE": 240,
    "REVIVALBLESSING": 241,
    "ROAR": 242,
    "ROCKBLAST": 243,
    "ROCKPOLISH": 244,
    "ROCKSLIDE": 245,
    "ROCKTOMB": 246,
    "ROOST": 247,
    "RUINATION": 248,
    "SACREDFIRE": 249,
    "SACREDSWORD": 250,
    "SALTCURE": 251,
    "SCALD": 252,
    "SCALESHOT": 253,
    "SCORCHINGSANDS": 254,
    "SECRETSWORD": 255,
    "SEEDBOMB": 256,
    "SEEDFLARE": 257,
    "SEISMICTOSS": 258,
    "SHADOWBALL": 259,
    "SHADOWCLAW": 260,
    "SHADOWSNEAK": 261,
    "SHEDTAIL": 262,
    "SHELLSIDEARM": 263,
    "SHELLSMASH": 264,
    "SHIFTGEAR": 265,
    "SHOREUP": 266,
    "SLACKOFF": 267,
    "SLEEPPOWDER": 268,
    "SLEEPTALK": 269,
    "SLUDGEBOMB": 270,
    "SLUDGEWAVE": 271,
    "SNOWSCAPE": 272,
    "SOFTBOILED": 273,
    "SOLARBEAM": 274,
    "SPACIALREND": 275,
    "SPARKLINGARIA": 276,
    "SPIKES": 277,
    "SPIRITBREAK": 278,
    "SPIRITSHACKLE": 279,
    "SPORE": 280,
    "STEALTHROCK": 281,
    "STEAMERUPTION": 282,
    "STICKYWEB": 283,
    "STOMPINGTANTRUM": 284,
    "STONEAXE": 285,
    "STONEEDGE": 286,
    "STOREDPOWER": 287,
    "STRANGESTEAM": 288,
    "STRENGTHSAP": 289,
    "STRUGGLE": 290,
    "STUNSPORE": 291,
    "SUBSTITUTE": 292,
    "SUCKERPUNCH": 293,
    "SUNNYDAY": 294,
    "SUNSTEELSTRIKE": 295,
    "SUPERCELLSLAM": 296,
    "SUPERFANG": 297,
    "SUPERPOWER": 298,
    "SURF": 299,
    "SURGINGSTRIKES": 300,
    "SWITCHEROO": 301,
    "SWORDSDANCE": 302,
    "SYNTHESIS": 303,
    "TACHYONCUTTER": 304,
    "TAILGLOW": 305,
    "TAILSLAP": 306,
    "TAILWIND": 307,
    "TAKEHEART": 308,
    "TAUNT": 309,
    "TELEPORT": 310,
    "TEMPERFLARE": 311,
    "TERABLAST": 312,
    "TERASTARSTORM": 313,
    "THROATCHOP": 314,
    "THUNDER": 315,
    "THUNDERBOLT": 316,
    "THUNDERCLAP": 317,
    "THUNDERPUNCH": 318,
    "THUNDERWAVE": 319,
    "TIDYUP": 320,
    "TORCHSONG": 321,
    "TOXIC": 322,
    "TOXICSPIKES": 323,
    "TRAILBLAZE": 324,
    "TRANSFORM": 325,
    "TRIATTACK": 326,
    "TRICK": 327,
    "TRICKROOM": 328,
    "TRIPLEARROWS": 329,
    "TRIPLEAXEL": 330,
    "UTURN": 331,
    "VACUUMWAVE": 332,
    "VICTORYDANCE": 333,
    "VOLTSWITCH": 334,
    "VOLTTACKLE": 335,
    "WATERFALL": 336,
    "WATERPULSE": 337,
    "WATERSPOUT": 338,
    "WAVECRASH": 339,
    "WEATHERBALL": 340,
    "WHIRLPOOL": 341,
    "WHIRLWIND": 342,
    "WICKEDBLOW": 343,
    "WILDCHARGE": 344,
    "WILLOWISP": 345,
    "WISH": 346,
    "WOODHAMMER": 347,
    "WORKUP": 348,
    "XSCISSOR": 349,
    "YAWN": 350,
    "ZENHEADBUTT": 351,
    "ZINGZAP": 352
  },
  "items": {
    "ADAMANTCRYSTAL": 1,
    "AIRBALLOON": 2,
    "ASSAULTVEST": 3,
    "BOOSTERENERGY": 4,
    "CHESTOBERRY": 5,
    "CHOICEBAND": 6,
    "CHOICESCARF": 7,
    "CHOICESPECS": 8,
    "CORNERSTONEMASK": 9,
    "CUSTAPBERRY": 10,
    "DRACOPLATE": 11,
    "DREADPLATE": 12,
    "EARTHPLATE": 13,
    "EVIOLITE": 14,
    "EXPERTBELT": 15,
    "FISTPLATE": 16,
    "FLAMEORB": 17,
    "FLAMEPLATE": 18,
    "FOCUSSASH": 19,
    "GRISEOUSCORE": 20,
    "HEARTHFLAMEMASK": 21,
    "HEAVYDUTYBOOTS": 22,
    "ICICLEPLATE": 23,
    "INSECTPLATE": 24,
    "IRONPLATE": 25,
    "LEFTOVERS": 26,
    "LIFEORB": 27,
    "LIGHTBALL": 28,
    "LOADEDDICE": 29,
    "LUMBERRY": 30,
    "LUSTROUSGLOBE": 31,
    "LUSTROUSORB": 32,
    "MAGNET": 33,
    "MEADOWPLATE": 34,
    "MINDPLATE": 35,
    "NONE": 36,
    "PIXIEPLATE": 37,
    "POWERHERB": 38,
    "ROCKYHELMET": 39,
    "RUSTEDSHIELD": 40,
    "RUSTEDSWORD": 41,
    "SILKSCARF": 42,
    "SILVERPOWDER": 43,
    "SITRUSBERRY": 44,
    "SKYPLATE": 45,
    "SOULDEW": 46,
    "SPLASHPLATE": 47,
    "SPOOKYPLATE": 48,
    "STONEPLATE": 49,
    "THROATSPRAY": 50,
    "TOXICORB": 51,
    "TOXICPLATE": 52,
    "UNKNOWNITEM": 53,
    "WEAKNESSPOLICY": 54,
    "WELLSPRINGMASK": 55,
    "WHITEHERB": 56,
    "WIDELENS": 57,
    "ZAPPLATE": 58
  },
  "abilities": {
    "ADAPTABILITY": 1,
    "AFTERMATH": 2,
    "AIRLOCK": 3,
    "ANALYTIC": 4,
    "ANGERSHELL": 5,
    "ARENATRAP": 6,
    "AROMAVEIL": 7,
    "ASONEGLASTRIER": 8,
    "ASONESPECTRIER": 9,
    "BADDREAMS": 10,
    "BATTLEBOND": 11,
    "BEADSOFRUIN": 12,
    "BERSERK": 13,
    "BIGPECKS": 14,
    "BLAZE": 15,
    "BULLETPROOF": 16,
    "CHEEKPOUCH": 17,
    "CHILLINGNEIGH": 18,
    "CHLOROPHYLL": 19,
    "CLEARBODY": 20,
    "CLOUDNINE": 21,
    "COMATOSE": 22,
    "COMPETITIVE": 23,
    "COMPOUNDEYES": 24,
    "CONTRARY": 25,
    "CORROSION": 26,
    "CUDCHEW": 27,
    "CURSEDBODY": 28,
    "CUTECHARM": 29,
    "DAMP": 30,
    "DANCER": 31,
    "DAUNTLESSSHIELD": 32,
    "DEFIANT": 33,
    "DISGUISE": 34,
    "DOWNLOAD": 35,
    "DRAGONSMAW": 36,
    "DRIZZLE": 37,
    "DROUGHT": 38,
    "DRYSKIN": 39,
    "EARLYBIRD": 40,
    "EARTHEATER": 41,
    "EFFECTSPORE": 42,
    "ELECTRICSURGE": 43,
    "ELECTROMORPHOSIS": 44,
    "EMBODYASPECTCORNERSTONE": 45,
    "EMBODYASPECTHEARTHFLAME": 46,
    "EMBODYASPECTWELLSPRING": 47,
    "FILTER": 48,
    "FLAMEBODY": 49,
    "FLASHFIRE": 50,
    "FLOWERVEIL": 51,
    "FLUFFY": 52,
    "FRISK": 53,
    "FULLMETALBODY": 54,
    "FURCOAT": 55,
    "GALEWINGS": 56,
    "GALVANIZE": 57,
    "GOODASGOLD": 58,
    "GOOEY": 59,
    "GRASSYSURGE": 60,
    "GRIMNEIGH": 61,
    "GULPMISSILE": 62,
    "GUTS": 63,
    "HADRONENGINE": 64,
    "HARVEST": 65,
    "HEATPROOF": 66,
    "HEAVYMETAL": 67,
    "HUGEPOWER": 68,
    "HUNGERSWITCH": 69,
    "HUSTLE": 70,
    "HYDRATION": 71,
    "ICEBODY": 72,
    "ICEFACE": 73,
    "ICESCALES": 74,
    "ILLUSION": 75,
    "IMPOSTER": 76,
    "INFILTRATOR": 77,
    "INNERFOCUS": 78,
    "INSOMNIA": 79,
    "INTIMIDATE": 80,
    "INTREPIDSWORD": 81,
    "IRONFIST": 82,
    "JUSTIFIED": 83,
    "KEENEYE": 84,
    "LEAFGUARD": 85,
    "LEVITATE": 86,
    "LIBERO": 87,
    "LIGHTMETAL": 88,
    "LIGHTNINGROD": 89,
    "LIMBER": 90,
    "LIQUIDOOZE": 91,
    "LIQUIDVOICE": 92,
    "MAGICBOUNCE": 93,
    "MAGICGUARD": 94,
    "MAGICIAN": 95,
    "MAGNETPULL": 96,
    "MEGALAUNCHER": 97,
    "MINDSEYE": 98,
    "MIRRORARMOR": 99,
    "MOLDBREAKER": 100,
    "MOTORDRIVE": 101,
    "MOXIE": 102,
    "MULTISCALE": 103,
    "MULTITYPE": 104,
    "MYCELIUMMIGHT": 105,
    "NATURALCURE": 106,
    "NOGUARD": 107,
    "NONE": 108,
    "OBLIVIOUS": 109,
    "ORICHALCUMPULSE": 110,
    "OVERCOAT": 111,
    "OVERGROW": 112,
    "OWNTEMPO": 113,
    "PICKPOCKET": 114,
    "PIXILATE": 115,
    "POISONHEAL": 116,
    "POISONPUPPETEER": 117,
    "POISONTOUCH": 118,
    "POWERSPOT": 119,
    "PRANKSTER": 120,
    "PRESSURE": 121,
    "PRISMARMOR": 122,
    "PROTEAN": 123,
    "PROTOSYNTHESIS": 124,
    "PSYCHICSURGE": 125,
    "PUNKROCK": 126,
    "PUREPOWER": 127,
    "PURIFYINGSALT": 128,
    "QUARKDRIVE": 129,
    "QUEENLYMAJESTY": 130,
    "QUICKFEET": 131,
    "RATTLED": 132,
    "RECKLESS": 133,
    "REGENERATOR": 134,
    "ROCKHEAD": 135,
    "ROCKYPAYLOAD": 136,
    "ROUGHSKIN": 137,
    "SANDRUSH": 138,
    "SANDSTREAM": 139,
    "SAPSIPPER": 140,
    "SCRAPPY": 141,
    "SEEDSOWER": 142,
    "SERENEGRACE": 143,
    "SHADOWSHIELD": 144,
    "SHADOWTAG": 145,
    "SHARPNESS": 146,
    "SHEDSKIN": 147,
    "SHEERFORCE": 148,
    "SHELLARMOR": 149,
    "SHIELDDUST": 150,
    "SHIELDSDOWN": 151,
    "SKILLLINK": 152,
    "SLOWSTART": 153,
    "SLUSHRUSH": 154,
    "SNIPER": 155,
    "SNOWWARNING": 156,
    "SOLIDROCK": 157,
    "SOULHEART": 158,
    "SOUNDPROOF": 159,
    "SPEEDBOOST": 160,
    "STAKEOUT": 161,
    "STAMINA": 162,
    "STATIC": 163,
    "STICKYHOLD": 164,
    "STORMDRAIN": 165,
    "STRONGJAW": 166,
    "STURDY": 167,
    "SUPREMEOVERLORD": 168,
    "SURGESURFER": 169,
    "SWARM": 170,
    "SWIFTSWIM": 171,
    "SWORDOFRUIN": 172,
    "SYNCHRONIZE": 173,
    "TABLETSOFRUIN": 174,
    "TANGLINGHAIR": 175,
    "TECHNICIAN": 176,
    "TERAFORMZERO": 177,
    "TERASHELL": 178,
    "TERASHIFT": 179,
    "TERAVOLT": 180,
    "THERMALEXCHANGE": 181,
    "THICKFAT": 182,
    "TINTEDLENS": 183,
    "TORRENT": 184,
    "TOUGHCLAWS": 185,
    "TOXICBOOST": 186,
    "TOXICCHAIN": 187,
    "TOXICDEBRIS": 188,
    "TRACE": 189,
    "TRANSISTOR": 190,
    "TRIAGE": 191,
    "TRUANT": 192,
    "TURBOBLAZE": 193,
    "UNAWARE": 194,
    "UNBURDEN": 195,
    "UNNERVE": 196,
    "UNSEENFIST": 197,
    "VESSELOFRUIN": 198,
    "VITALSPIRIT": 199,
    "VOLTABSORB": 200,
    "WATERABSORB": 201,
    "WATERBUBBLE": 202,
    "WATERCOMPACTION": 203,
    "WATERVEIL": 204,
    "WEAKARMOR": 205,
    "WELLBAKEDBODY": 206,
    "WINDRIDER": 207,
    "ZEROTOHERO": 208
  }
}